# Brewfile - Homebrew Bundle
# Install everything: brew bundle
# Based on Mac Setup Guide (2025)

# ========================================
# Taps
# ========================================

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# ========================================
# Terminal & Shell
# ========================================

# Terminal
cask "iterm2"

# ZSH plugin manager
brew "antidote"

# Powerlevel10k prompt theme
brew "powerlevel10k"

# FZF fuzzy finder
brew "fzf"

# ========================================
# Modern CLI Tools
# ========================================

# Better cat
brew "bat"

# Better ls
brew "eza"

# Better grep
brew "ripgrep"

# Better find
brew "fd"

# Smart cd
brew "zoxide"

# Better top
brew "btop"

# Fast tldr
brew "tealdeer"

# Interactive cheatsheets
brew "navi"

# Better git diff
brew "git-delta"

# Git TUI
brew "lazygit"

# Disk usage analyzer
brew "gdu"

# JSON processor
brew "jq"

# YAML processor
brew "yq"

# Process viewer
brew "htop"

# Directory tree
brew "tree"

# ========================================
# Development Tools
# ========================================

# Git
brew "git"

# Neovim
brew "neovim"

# Programming languages
brew "python3"
brew "golang"
brew "node"

# Version managers
brew "nvm"
brew "pyenv"
brew "rbenv"

# ========================================
# Utilities
# ========================================

# Download tools
brew "wget"
brew "curl"

# Tmux
brew "tmux"

# Mac App Store CLI
brew "mas"

# GitHub CLI
brew "gh"

# ========================================
# Applications (Casks)
# ========================================

# Browsers
cask "google-chrome"
cask "firefox"

# Security
cask "1password"

# Development
cask "visual-studio-code"  # Optional
cask "docker"
cask "postman"

# Communication
cask "slack"
cask "discord"

# Utilities
cask "rectangle"           # Window management
cask "raycast"             # Launcher

# ========================================
# Fonts
# ========================================

# Nerd Fonts (choose what you need)
cask "font-meslo-lg-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# ========================================
# Mac App Store Apps
# ========================================

# Install after: mas install <id>
# Find IDs: mas search "app name"

# Examples:
# mas "Xcode", id: 497799835

# ========================================
# Optional Tools
# ========================================

# Uncomment if needed:
# brew "vim"
# brew "tmux"
# brew "ansible"
# brew "terraform"
# brew "kubernetes-cli"
# cask "obsidian"
# cask "notion"
